# Файл с текстовыми константами
bot_start = '%s запустился.'
bot_ready = '%s подключился к чатам:\n'
member_join = '%s присоединился к серверу %s'
member_leave = '%s покинул сервер %s'

command_error = '**Ошибка при выполнении команды:** команды была написана неверно.'
command_random = 'Случайное число между %s и %s: %s'
expression_limit_deny = '# __В вашем сообщении есть выражение, длина которого больше установленного в ' \
                        'настройках бота - %s символов. Выражения в вашем сообщении вычисляться не будут.__'
image_error = '**Ошибка при выполнении команды:** аргумент был указан неверно.(возм. аргументы:' \
              'blacknwhite, negative, mirror, horror, aggressive, pixel)'
module_set = 'Модуль %s переключен в состояние %s.'

# help
help_random = 'Отправляет случайное число от num1 до num2.(num2 по умолчанию = 1)'
help_random_user = 'Возвращает случайного пользователя с этого сервера.'
help_msg_calc = 'При написании в сообщении ! перед мат. выражением бот ' \
                'отправляет в следующем сообщении решение.(пр.: 8x8=64)(лимит длины выражения - %s)'
help_image = 'mode - может быть от 0 до 3, взависимости от режима обработки.'
help_ = 'Возвращает это сообщение.'

# help_admin
help_admin_clear = 'Удаляет num+1 сообщений в конкретном канале.'
help_admin_link_banner_module = 'Откл./Вкл. модуль с удалением сторонних ссылок. В данный момент модуль %s.'
help_admin_msg_calc_module = 'Откл./Вкл. модуль с вычислением мат. выражений. В данный момент модуль %s.'
help_admin_image_module = 'Откл./Вкл. модуль с обработкой картинок. В данный момент модуль %s.'
help_admin_ = 'Возвращает это сообщение.'
